In [8]:
import pandas as pd
import numpy as np

In [2]:
stu = ['Rahul','Ram','Raghav','Raghunath']

In [5]:
pd.Series(stu,index=[1,2,3,4])

1        Rahul
2          Ram
3       Raghav
4    Raghunath
dtype: object

In [6]:
stu = ['Alice','Jack',None] #pandas accepts None as a object 
pd.Series(stu)

0    Alice
1     Jack
2     None
dtype: object

In [7]:
num = [1,2,3,4,5,None]
pd.Series(num) #it throws as NaN when we give none

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
dtype: float64

In [9]:
np.nan == None #because empty array can exist in numpy

False

In [10]:
np.nan == np.nan

False

In [11]:
np.isnan(np.nan)

True

In [43]:
a = pd.Series(['phy','eng','mat','sci'],index=[1,2,3,4])
a

1    phy
2    eng
3    mat
4    sci
dtype: object

In [19]:
stud = {'alice':89,'jack':97,'hary':76}
s = pd.Series(stud)
s

alice    89
jack     97
hary     76
dtype: int64

In [18]:
s.index  #pandas has index function and dict does not have that function

Index(['alice', 'jack', 'hary'], dtype='object')

In [27]:
s.iloc[2]

76

In [25]:
s.loc['hary']

76

In [28]:
s[2]

76

In [31]:
a = pd.Series([1,2,3,4,5,6,7])
d = 0
for i in a:
    d+=i
print('AVG : ',d/len(a))
print('SUM : ',d)

AVG :  4.0
SUM :  28

In [32]:
np.sum(a) # we can perform array operations also using numpy

28

In [ ]:
num = pd.Series(np.random.randint(0,1000,10000))
num.head()

In [36]:
len(num)

10000

# TIME COMPLEXITY OF NUMPY

In [37]:
%%timeit -n 100
total = 0
for n in num:
    total+=n
total/len(num)

3.25 ms ± 429 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [38]:
%%timeit -n 100
total = np.sum(num)
total/len(num)  #Numpy gives high performance in both space and time complexity issues

161 µs ± 39.2 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

# DATAFRAMES

In [56]:
a = pd.Series({"Name":'Rahul',
             "Age":19,
             "Gender":'male'
              } ) 
b = pd.Series({"Name":'Raghu',
             "Age":19,
             "Gender":'male'
              } ) 
c = pd.Series({"Name":'Raghava',
             "Age":19,
             "Gender":'male'
              } ) 

df = pd.DataFrame([a,b,c],index=[1,2,3])
df

      Name  Age Gender
1    Rahul   19   male
2    Raghu   19   male
3  Raghava   19   male

In [57]:
a = pd.Series({"Name":'Rajini',
             "Age":20,
             "Gender":'female'
              } ) 
b = pd.Series({"Name":'Ramya',
             "Age":21,
             "Gender":'female'
              } ) 
c = pd.Series({"Name":'Radha',
             "Age":19,
             "Gender":'female'
              } ) 

df1 = pd.DataFrame([a,b,c],index=[1,2,3])
df1

     Name  Age  Gender
1  Rajini   20  female
2   Ramya   21  female
3   Radha   19  female

In [63]:
df.loc[1]

Name      Rahul
Age          19
Gender     male
Name: 1, dtype: object

In [61]:
df.iloc[0]

Name      Rahul
Age          19
Gender     male
Name: 1, dtype: object

In [64]:
type(df)

pandas.core.frame.DataFrame

In [65]:
df.loc[1,'Name']

'Rahul'

In [67]:
df.T.loc['Name'] # T is used to make access to the contents of dataframe

1      Rahul
2      Raghu
3    Raghava
Name: Name, dtype: object

In [68]:
df['Name']

1      Rahul
2      Raghu
3    Raghava
Name: Name, dtype: object

In [69]:
df.loc[1]['Name']

'Rahul'

In [70]:
df.loc[:,['Name','Age']]

      Name  Age
1    Rahul   19
2    Raghu   19
3  Raghava   19

In [77]:
df['Score'] = None
df

      Name  Age Gender Score
1    Rahul   19   male  None
2    Raghu   19   male  None
3  Raghava   19   male  None

In [78]:
df['Percentage'] = [94,93,92]
df

      Name  Age Gender Score  Percentage
1    Rahul   19   male  None          94
2    Raghu   19   male  None          93
3  Raghava   19   male  None          92

In [79]:
df['Score'] = [100,89,97]
df

      Name  Age Gender  Score  Percentage
1    Rahul   19   male    100          94
2    Raghu   19   male     89          93
3  Raghava   19   male     97          92